transonic-dlrbuffet-rhoCentralRKFoam/setups.orig/kOmegaSST/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/freestreamConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $poutlet;

boundaryField
{
    INLET
    {
      	//type zeroGradient;
	//value         uniform  $pinlet;
        type characteristicVelocityInletOutletPressure;
        //type characteristicFarfieldPressure;
        U $Uinlet;
        p $pinlet;
        T $Tinlet;
        value $internalField;

    }
    OUTLET
    {
        //type           fixedMean;
        //meanValue      $poutlet;
        //value          uniform $poutlet;
        type characteristicPressureInletOutletPressure;
        //type characteristicFarfieldPressure;
        U $Uoutlet;
        p $poutlet;
        T $Toutlet;
        value $internalField;
    }
    row_1_PER1
    {
        type            cyclic;
    }
    row_1_PER2
    {
        type            cyclic;

    }
    Blade
    {
        type            zeroGradient;
      //  type            characteristicWallPressure;
      //  value           $internalField;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
